import type { Chapter } from '../../types'

const chapter: Chapter = {
  id: 'sahih/7',
  type: {
    arabic: 'صحيح',
    transliterated: 'sahih',
  },
  form: {
    number: 7,
    roman: 'VII',
    english: '7',
  },
  chapter: {
    arabic: 'انْفِعَال',
    transliterated: "infi'aal",
  },
  exists: true,
  title: 'انْفَعَلَ يَنْفَعِلُ',
  root_letters: [
    {
      arabic: {
        ف: 'ص',
        ع: 'ر',
        ل: 'ف',
      },
      english: {
        base: 'turn',
        specifically: 'away',
      },
      transliterated: 'insarafa',
    },
    {
      arabic: {
        ف: 'ق',
        ع: 'س',
        ل: 'ن',
      },
      english: {
        base: 'divided',
        prefixToBe: true,
      },
      transliterated: 'inqasana',
    },
    {
      arabic: {
        ف: 'ك',
        ع: 'ش',
        ل: 'ف',
      },
      english: {
        base: 'revealed',
        prefixToBe: true,
      },
      transliterated: 'inkashafa',
    },
  ],
  'صرف صغير': {
    مصدر: 'انْفِعَالًا',
    معروف: {
      ماضي: 'انْفَعَلَ',
      مضارع: 'يَنْفَعِلُ',
      فاعل: 'مُنْفَعِلٌ',
    },
    مجهول: null,
    أمر: 'انْفَعِلْ',
    نهي: 'تَنْفَعِلْ',
  },
  'صرف كبير': {
    معروف: {
      ماضي: {
        هُوَ: 'انْفَعَلَ',
        هُمَا_مُذَكَّر: 'انْفَعَلَا',
        هُمْ: 'انْفَعَلُوْا',
        هِيَ: 'انْفَعَلَتْ',
        هُمَا_مُؤَنَّث: 'انْفَعَلَتَا',
        هُنَّ: 'انْفَعَلْنَ',
        أَنْتَ: 'انْفَعَلْتَ',
        أَنْتُمَا: 'انْفَعَلْتُمَا',
        أَنْتُمْ: 'انْفَعَلْتُمْ',
        أَنْتِ: 'انْفَعَلْتِ',
        أَنْتُنَّ: 'انْفَعَلْتُنَّ',
        أَنَا: 'انْفَعَلْتُ',
        نَحْنُ: 'انْفَعَلْنَا',
      },
      مضارع: {
        مرفوع: {
          هُوَ: 'يَنْفَعِلُ',
          هُمَا_مُذَكَّر: 'يَنْفَعِلَانِ',
          هُمْ: 'يَنْفَعِلُوْنَ',
          هِيَ: 'تَنْفَعِلُ',
          هُمَا_مُؤَنَّث: 'تَنْفَعِلَانِ',
          هُنَّ: 'يَنْفَعِلْنَ',
          أَنْتَ: 'تَنْفَعِلُ',
          أَنْتُمَا: 'تَنْفَعِلَانِ',
          أَنْتُمْ: 'تَنْفَعِلُوْنَ',
          أَنْتِ: 'تَنْفَعِلِيْنَ',
          أَنْتُنَّ: 'تَنْفَعِلْنَ',
          أَنَا: 'أَنْفَعِلُ',
          نَحْنُ: 'نَنْفَعِلُ',
        },
        منصوب: {
          هُوَ: 'يَنْفَعِلَ',
          هُمَا_مُذَكَّر: 'يَنْفَعِلَا',
          هُمْ: 'يَنْفَعِلُوْا',
          هِيَ: 'تَنْفَعِلَ',
          هُمَا_مُؤَنَّث: 'تَنْفَعِلَا',
          هُنَّ: 'يَنْفَعِلْنَ',
          أَنْتَ: 'تَنْفَعِلَ',
          أَنْتُمَا: 'تَنْفَعِلَا',
          أَنْتُمْ: 'تَنْفَعِلُوْا',
          أَنْتِ: 'تَنْفَعِلِيْ',
          أَنْتُنَّ: 'تَنْفَعِلْنَ',
          أَنَا: 'أَنْفَعِلَ',
          نَحْنُ: 'نَنْفَعِلَ',
        },
        مجزوم: {
          هُوَ: 'يَنْفَعِلْ',
          هُمَا_مُذَكَّر: 'يَنْفَعِلَا',
          هُمْ: 'يَنْفَعِلُوْا',
          هِيَ: 'تَنْفَعِلْ',
          هُمَا_مُؤَنَّث: 'تَنْفَعِلَا',
          هُنَّ: 'يَنْفَعِلْنَ',
          أَنْتَ: 'تَنْفَعِلْ',
          أَنْتُمَا: 'تَنْفَعِلَا',
          أَنْتُمْ: 'تَنْفَعِلُوْا',
          أَنْتِ: 'تَنْفَعِلِيْ',
          أَنْتُنَّ: 'تَنْفَعِلْنَ',
          أَنَا: 'أَنْفَعِلْ',
          نَحْنُ: 'نَنْفَعِلْ',
        },
      },
      أمر: {
        أَنْتَ: 'انْفَعِلْ',
        أَنْتُمَا: 'انْفَعِلَا',
        أَنْتُمْ: 'انْفَعِلُوْا',
        أَنْتِ: 'انْفَعِلِيْ',
        أَنْتُنَّ: 'انْفَعِلْنَ',
      },
    },
    مجهول: null,
  },
  مشتق: {
    مصدر: ['انْفِعَالًا'],
    فاعل: {
      مُذَكَّر: {
        مُفْرَد: 'مُنْفَعِلٌ',
        مُثَنَّى: 'مُنْفَعِلَانِ',
        جَمْع: 'مُنْفَعِلُوْنَ',
      },
      مُؤَنَّث: {
        مُفْرَد: 'مُنْفَعِلَةٌ',
        مُثَنَّى: 'مُنْفَعِلَتَانِ',
        جَمْع: 'مُنْفَعِلَاتٌ',
      },
    },
    مفعول: null,
  },
}

export default chapter
