import type { Chapter } from '../../types'

const chapter: Chapter = {
  id: 'sahih/9',
  type: {
    arabic: 'صحيح',
    transliterated: 'sahih',
  },
  form: {
    number: 9,
    roman: 'IX',
    english: '9',
  },
  chapter: {
    arabic: 'افْعِلَال',
    transliterated: "if'ilaal",
  },
  title: 'افْعَلَّ يَفْعَلُّ',
  root_letters: [
    {
      arabic: {
        ف: 'ح',
        ع: 'م',
        ل: 'ر',
      },
      english: {
        base: 'become',
        past: 'became',
        passive: 'turned',
        specifically: 'red',
      },
      transliterated: 'ihmarra',
    },
  ],
  'صرف صغير': {
    مصدر: 'افْعِلَالًا',
    معروف: {
      ماضي: 'افْعَلَّ',
      مضارع: 'يَفْعَلُّ',
      فاعل: 'مُفْعَلٌّ',
    },
    مجهول: null,
    أمر: 'افْعَلَّ',
    نهي: 'تَفْعَلَّ',
  },
  'صرف كبير': {
    معروف: {
      ماضي: {
        هُوَ: 'افْعَلَّ',
        هُمَا: {
          مُذَكَّر: 'افْعَلَّا',
          مُؤَنَّث: 'افْعَلَّتَا',
        },
        هُمْ: 'افْعَلُّوْا',
        هِيَ: 'افْعَلَّتْ',
        هُنَّ: 'افْعَلَلْنَ',
        أَنْتَ: 'افْعَلَلْتَ',
        أَنْتُمَا: 'افْعَلَلْتُمَا',
        أَنْتُمْ: 'افْعَلَلْتُمْ',
        أَنْتِ: 'افْعَلَلْتِ',
        أَنْتُنَّ: 'افْعَلَلْتُنَّ',
        أَنَا: 'افْعَلَلْتُ',
        نَحْنُ: 'افْعَلَلْنَا',
      },
      مضارع: {
        مرفوع: {
          هُوَ: 'يَفْعَلُّ',
          هُمَا: {
            مُذَكَّر: 'يَفْعَلَّانِ',
            مُؤَنَّث: 'تَفْعَلَّانِ',
          },
          هُمْ: 'يَفْعَلُّوْنَ',
          هِيَ: 'تَفْعَلُّ',
          هُنَّ: 'يَفْعَلِلْنَ',
          أَنْتَ: 'تَفْعَلُّ',
          أَنْتُمَا: 'تَفْعَلَّانِ',
          أَنْتُمْ: 'تَفْعَلُّوْنَ',
          أَنْتِ: 'تَفْعَلِّيْنَ',
          أَنْتُنَّ: 'تَفْعَلِلْنَ',
          أَنَا: 'أَفْعَلُّ',
          نَحْنُ: 'نَفْعَلُّ',
        },
        منصوب: {
          هُوَ: 'يَفْعَلَّ',
          هُمَا: {
            مُذَكَّر: 'يَفْعَلَّا',
            مُؤَنَّث: 'تَفْعَلَّا',
          },
          هُمْ: 'يَفْعَلُّوْا',
          هِيَ: 'تَفْعَلَّ',
          هُنَّ: 'يَفْعَلِلْنَ',
          أَنْتَ: 'تَفْعَلَّ',
          أَنْتُمَا: 'تَفْعَلَّا',
          أَنْتُمْ: 'تَفْعَلُّوْا',
          أَنْتِ: 'تَفْعَلِّيْ',
          أَنْتُنَّ: 'تَفْعَلِلْنَ',
          أَنَا: 'أَفْعَلَّ',
          نَحْنُ: 'نَفْعَلَّ',
        },
        مجزوم: {
          هُوَ: 'يَفْعَلَّ',
          هُمَا: {
            مُذَكَّر: 'يَفْعَلَّا',
            مُؤَنَّث: 'تَفْعَلَّا',
          },
          هُمْ: 'يَفْعَلُّوْا',
          هِيَ: 'تَفْعَلَّ',
          هُنَّ: 'يَفْعَلِلْنَ',
          أَنْتَ: 'تَفْعَلَّ',
          أَنْتُمَا: 'تَفْعَلَّا',
          أَنْتُمْ: 'تَفْعَلُّوْا',
          أَنْتِ: 'تَفْعَلِّيْ',
          أَنْتُنَّ: 'تَفْعَلِلْنَ',
          أَنَا: 'أَفْعَلَّ',
          نَحْنُ: 'نَفْعَلَّ',
        },
      },
      أمر: {
        أَنْتَ: 'افْعَلَّ',
        أَنْتُمَا: 'افْعَلَّا',
        أَنْتُمْ: 'افْعَلُّوْا',
        أَنْتِ: 'افْعَلِّيْ',
        أَنْتُنَّ: 'افْعَلِلْنَ',
      },
    },
    مجهول: null,
  },
  مشتق: {
    مصدر: ['افْعِلَالًا'],
    فاعل: {
      مُذَكَّر: {
        مُفْرَد: 'مُفْعَلٌّ',
        مُثَنَّى: 'مُفْعَلَّانِ',
        جَمْع: 'مُفْعَلُّوْنَ',
      },
      مُؤَنَّث: {
        مُفْرَد: 'مُفْعَلَّةٌ',
        مُثَنَّى: 'مُفْعَلَّتَانِ',
        جَمْع: 'مُفْعَلَّاتٌ',
      },
    },
    مفعول: null,
  },
}

export default chapter
