import type { Chapter } from '../../types'

const chapter: Chapter = {
  id: "mudaa'af/7",
  type: {
    arabic: 'مضاعف',
    transliterated: "mudaa'af",
  },
  form: {
    number: 7,
    roman: 'VII',
    english: '7',
  },
  chapter: {
    arabic: 'انْفِعَال',
    transliterated: "infi'aal",
  },
  title: 'انْفَعَّ يَنْفَعُّ',
  root_letters: [
    {
      arabic: {
        ف: 'ح',
        ع: 'ل',
        ل: 'ل',
      },
      english: 'open',
      transliterated: 'inhalla',
    },
  ],
  'صرف صغير': {
    مصدر: 'انْفِعَالًا',
    معروف: {
      ماضي: 'انْفَعَّ',
      مضارع: 'يَنْفَعُّ',
      فاعل: 'مُنْفَعٌّ',
    },
    مجهول: null,
    أمر: 'انْفَعَّ',
    نهي: 'تَنْفَعَّ',
  },
  'صرف كبير': {
    معروف: {
      ماضي: {
        هُوَ: 'انْفَعَّ',
        هُمَا_مُذَكَّر: 'انْفَعَّا',
        هُمْ: 'انْفَعُّوْا',
        هِيَ: 'انْفَعَّتْ',
        هُمَا_مُؤَنَّث: 'انْفَعَّتَا',
        هُنَّ: 'انْفَعَلْنَ',
        أَنْتَ: 'انْفَعَلْتَ',
        أَنْتُمَا: 'انْفَعَلْتُمَا',
        أَنْتُمْ: 'انْفَعَلْتُمْ',
        أَنْتِ: 'انْفَعَلْتِ',
        أَنْتُنَّ: 'انْفَعَلْتُنَّ',
        أَنَا: 'انْفَعَلْتُ',
        نَحْنُ: 'انْفَعَلْنَا',
      },
      مضارع: {
        مرفوع: {
          هُوَ: 'يَنْفَعُّ',
          هُمَا_مُذَكَّر: 'يَنْفَعَّانِ',
          هُمْ: 'يَنْفَعُّوْنَ',
          هِيَ: 'تَنْفَعُّ',
          هُمَا_مُؤَنَّث: 'تَنْفَعَّانِ',
          هُنَّ: 'يَنْفَعِلْنَ',
          أَنْتَ: 'تَنْفَعُّ',
          أَنْتُمَا: 'تَنْفَعَّانِ',
          أَنْتُمْ: 'تَنْفَعُّوْنَ',
          أَنْتِ: 'تَنْفَعِّيْنَ',
          أَنْتُنَّ: 'تَنْفَعِلْنَ',
          أَنَا: 'أَنْفَعُّ',
          نَحْنُ: 'نَنْفَعُّ',
        },
        منصوب: {
          هُوَ: 'يَنْفَعَّ',
          هُمَا_مُذَكَّر: 'يَنْفَعَّا',
          هُمْ: 'يَنْفَعُّوْا',
          هِيَ: 'تَنْفَعَّ',
          هُمَا_مُؤَنَّث: 'تَنْفَعَّا',
          هُنَّ: 'يَنْفَعِلْنَ',
          أَنْتَ: 'تَنْفَعَّ',
          أَنْتُمَا: 'تَنْفَعَّا',
          أَنْتُمْ: 'تَنْفَعُّوْا',
          أَنْتِ: 'تَنْفَعِّيْ',
          أَنْتُنَّ: 'تَنْفَعِلْنَ',
          أَنَا: 'أَنْفَعَّ',
          نَحْنُ: 'نَنْفَعَّ',
        },
        مجزوم: {
          هُوَ: 'يَنْفَعَّ',
          هُمَا_مُذَكَّر: 'يَنْفَعَّا',
          هُمْ: 'يَنْفَعُّوْا',
          هِيَ: 'تَنْفَعَّ',
          هُمَا_مُؤَنَّث: 'تَنْفَعَّا',
          هُنَّ: 'يَنْفَعِلْنَ',
          أَنْتَ: 'تَنْفَعَّ',
          أَنْتُمَا: 'تَنْفَعَّا',
          أَنْتُمْ: 'تَنْفَعُّوْا',
          أَنْتِ: 'تَنْفَعِّيْ',
          أَنْتُنَّ: 'تَنْفَعِلْنَ',
          أَنَا: 'أَنْفَعَّ',
          نَحْنُ: 'نَنْفَعَّ',
        },
      },
      أمر: {
        أَنْتَ: 'انْفَعَّ',
        أَنْتُمَا: 'انْفَعَّا',
        أَنْتُمْ: 'انْفَعُّوْا',
        أَنْتِ: 'انْفَعِّيْ',
        أَنْتُنَّ: 'انْفَعِلْنَ',
      },
    },
    مجهول: null,
  },
  مشتق: {
    مصدر: ['انْفِعَالًا'],
    فاعل: {
      مُذَكَّر: {
        مُفْرَد: 'مُنْفَعٌّ',
        مُثَنَّى: 'مُنْفَعَّانِ',
        جَمْع: 'مُنْفَعُّوْنَ',
      },
      مُؤَنَّث: {
        مُفْرَد: 'مُنْفَعَّةٌ',
        مُثَنَّى: 'مُنْفَعَّتَانِ',
        جَمْع: 'مُنْفَعَّاتٌ',
      },
    },
    مفعول: null,
  },
}

export default chapter
