import type { Chapter } from '../../types'

const chapter: Chapter = {
  id: 'naaqis/7',
  type: {
    arabic: 'ناقص',
    transliterated: 'naaqis',
  },
  form: {
    number: 7,
    roman: 'VII',
    english: '7',
  },
  chapter: {
    arabic: 'انْفِعَال',
    transliterated: "infi'aal",
  },
  exists: true,
  title: 'انْفَعَى يَنْفَعِيْ',
  root_letters: [
    {
      arabic: {
        ف: 'ج',
        ع: 'ل',
        ل: 'و',
      },
      english: 'reveal',
      transliterated: 'injalaa',
    },
    {
      arabic: {
        ف: 'ح',
        ع: 'ن',
        ل: 'و',
      },
      english: 'curve',
      transliterated: 'inhanaa',
    },
  ],
  'صرف صغير': {
    مصدر: 'انْفِعَاءً',
    معروف: {
      ماضي: 'انْفَعَى',
      مضارع: 'يَنْفَعِيْ',
      فاعل: 'مُنْفَعٍ',
    },
    مجهول: null,
    أمر: 'انْفَعِ',
    نهي: 'تَنْفَعِ',
  },
  'صرف كبير': {
    معروف: {
      ماضي: {
        هُوَ: 'انْفَعَى',
        هُمَا_مُذَكَّر: 'انْفَعَيَا',
        هُمْ: 'انْفَعَوْا',
        هِيَ: 'انْفَعَتْ',
        هُمَا_مُؤَنَّث: 'انْفَعَتَا',
        هُنَّ: 'انْفَعَيْنَ',
        أَنْتَ: 'انْفَعَيْتَ',
        أَنْتُمَا: 'انْفَعَيْتُمَا',
        أَنْتُمْ: 'انْفَعَيْتُمْ',
        أَنْتِ: 'انْفَعَيْتِ',
        أَنْتُنَّ: 'انْفَعَيْتُنَّ',
        أَنَا: 'انْفَعَيْتُ',
        نَحْنُ: 'انْفَعَيْنَا',
      },
      مضارع: {
        مرفوع: {
          هُوَ: 'يَنْفَعِيْ',
          هُمَا_مُذَكَّر: 'يَنْفَعِيَانِ',
          هُمْ: 'يَنْفَعُوْنَ',
          هِيَ: 'تَنْفَعِيْ',
          هُمَا_مُؤَنَّث: 'تَنْفَعِيَانِ',
          هُنَّ: 'يَنْفَعِيْنَ',
          أَنْتَ: 'تَنْفَعِيْ',
          أَنْتُمَا: 'تَنْفَعِيَانِ',
          أَنْتُمْ: 'تَنْفَعُوْنَ',
          أَنْتِ: 'تَنْفَعِيْنَ',
          أَنْتُنَّ: 'تَنْفَعِيْنَ',
          أَنَا: 'أَنْفَعِيْ',
          نَحْنُ: 'نَنْفَعِيْ',
        },
        منصوب: {
          هُوَ: 'يَنْفَعِيَ',
          هُمَا_مُذَكَّر: 'يَنْفَعِيَا',
          هُمْ: 'يَنْفَعُوْا',
          هِيَ: 'تَنْفَعِيَ',
          هُمَا_مُؤَنَّث: 'تَنْفَعِيَا',
          هُنَّ: 'يَنْفَعِيْنَ',
          أَنْتَ: 'تَنْفَعِيَ',
          أَنْتُمَا: 'تَنْفَعِيَا',
          أَنْتُمْ: 'تَنْفَعُوْا',
          أَنْتِ: 'تَنْفَعِيْ',
          أَنْتُنَّ: 'تَنْفَعِيْنَ',
          أَنَا: 'أَنْفَعِيَ',
          نَحْنُ: 'نَنْفَعِيَ',
        },
        مجزوم: {
          هُوَ: 'يَنْفَعِ',
          هُمَا_مُذَكَّر: 'يَنْفَعِيَا',
          هُمْ: 'يَنْفَعُوْا',
          هِيَ: 'تَنْفَعِ',
          هُمَا_مُؤَنَّث: 'تَنْفَعِيَا',
          هُنَّ: 'يَنْفَعِيْنَ',
          أَنْتَ: 'تَنْفَعِ',
          أَنْتُمَا: 'تَنْفَعِيَا',
          أَنْتُمْ: 'تَنْفَعُوْا',
          أَنْتِ: 'تَنْفَعِيْ',
          أَنْتُنَّ: 'تَنْفَعِيْنَ',
          أَنَا: 'أَنْفَعِ',
          نَحْنُ: 'نَنْفَعِ',
        },
      },
      أمر: {
        أَنْتَ: 'انْفَعِ',
        أَنْتُمَا: 'انْفَعِيَا',
        أَنْتُمْ: 'انْفَعُوْا',
        أَنْتِ: 'انْفَعِيْ',
        أَنْتُنَّ: 'انْفَعِيْنَ',
      },
    },
    مجهول: null,
  },
  مشتق: {
    مصدر: ['انْفِعَاءً'],
    فاعل: {
      مُذَكَّر: {
        مُفْرَد: 'مُنْفَعٍ',
        مُثَنَّى: 'مُنْفَعَانِ',
        جَمْع: 'مُنْفَعُوْنَ',
      },
      مُؤَنَّث: {
        مُفْرَد: 'مُنْفَعَةٌ',
        مُثَنَّى: 'مُنْفَعَتَانِ',
        جَمْع: 'مُنْفَعَاتٌ',
      },
    },
    مفعول: null,
  },
}

export default chapter
