import type { Chapter } from '../../types'

const chapter: Chapter = {
  id: 'naaqis/radiya',
  type: {
    arabic: 'ناقص',
    transliterated: 'naaqis',
  },
  form: {
    number: 1,
    roman: 'I',
    english: '1c',
  },
  chapter: {
    arabic: 'سَمِعَ',
    transliterated: "sami'a",
  },
  title: 'فَعِيَ يَفْعَى',
  root_letters: [
    {
      arabic: {
        ف: 'ر',
        ع: 'ض',
        ل: 'ي',
      },
      english: {
        base: 'pleased',
        prefixToBe: true,
      },
      transliterated: 'radiya',
    },
    {
      arabic: {
        ف: 'خ',
        ع: 'ش',
        ل: 'ي',
      },
      english: 'fear',
      transliterated: 'khashiya',
    },
    {
      arabic: {
        ف: 'ن',
        ع: 'س',
        ل: 'ي',
      },
      english: {
        base: 'forget',
        past: 'forgot',
        presentContinuous: 'forgetting',
        passive: 'forgotten',
      },
      transliterated: 'nasiya',
    },
  ],
  'صرف صغير': {
    مصدر: 'فِعًا',
    معروف: {
      ماضي: 'فَعِيَ',
      مضارع: 'يَفْعَى',
      فاعل: 'فَاعٍ',
    },
    مجهول: {
      ماضي: 'فُعِيَ',
      مضارع: 'يُفْعَى',
      مفعول: 'مَفْعِيٌّ',
    },
    أمر: 'افْعَ',
    نهي: 'تَفْعَ',
  },
  'صرف كبير': {
    معروف: {
      ماضي: {
        هُوَ: 'فَعِيَ',
        هُمَا: {
          مُذَكَّر: 'فَعِيَا',
          مُؤَنَّث: 'فَعِيَتَا',
        },
        هُمْ: 'فَعُوْا',
        هِيَ: 'فَعِيَتْ',
        هُنَّ: 'فَعِيْنَ',
        أَنْتَ: 'فَعِيْتَ',
        أَنْتُمَا: 'فَعِيْتُمَا',
        أَنْتُمْ: 'فَعِيْتُمْ',
        أَنْتِ: 'فَعِيْتِ',
        أَنْتُنَّ: 'فَعِيْتُنَّ',
        أَنَا: 'فَعِيْتُ',
        نَحْنُ: 'فَعِيْنَا',
      },
      مضارع: {
        مرفوع: {
          هُوَ: 'يَفْعَى',
          هُمَا: {
            مُذَكَّر: 'يَفْعَيَانِ',
            مُؤَنَّث: 'تَفْعَيَانِ',
          },
          هُمْ: 'يَفْعَوْنَ',
          هِيَ: 'تَفْعَى',
          هُنَّ: 'يَفْعَيْنَ',
          أَنْتَ: 'تَفْعَى',
          أَنْتُمَا: 'تَفْعَيَانِ',
          أَنْتُمْ: 'تَفْعَوْنَ',
          أَنْتِ: 'تَفْعَيْنَ',
          أَنْتُنَّ: 'تَفْعَيْنَ',
          أَنَا: 'أَفْعَى',
          نَحْنُ: 'نَفْعَى',
        },
        منصوب: {
          هُوَ: 'يَفْعَى',
          هُمَا: {
            مُذَكَّر: 'يَفْعَيَا',
            مُؤَنَّث: 'تَفْعَيَا',
          },
          هُمْ: 'يَفْعَوْا',
          هِيَ: 'تَفْعَى',
          هُنَّ: 'يَفْعَيْنَ',
          أَنْتَ: 'تَفْعَى',
          أَنْتُمَا: 'تَفْعَيَا',
          أَنْتُمْ: 'تَفْعَوْا',
          أَنْتِ: 'تَفْعَيْ',
          أَنْتُنَّ: 'تَفْعَيْنَ',
          أَنَا: 'أَفْعَى',
          نَحْنُ: 'نَفْعَى',
        },
        مجزوم: {
          هُوَ: 'يَفْعَ',
          هُمَا: {
            مُذَكَّر: 'يَفْعَيَا',
            مُؤَنَّث: 'تَفْعَيَا',
          },
          هُمْ: 'يَفْعَوْا',
          هِيَ: 'تَفْعَ',
          هُنَّ: 'يَفْعَيْنَ',
          أَنْتَ: 'تَفْعَ',
          أَنْتُمَا: 'تَفْعَيَا',
          أَنْتُمْ: 'تَفْعَوْا',
          أَنْتِ: 'تَفْعَيْ',
          أَنْتُنَّ: 'تَفْعَيْنَ',
          أَنَا: 'أَفْعَ',
          نَحْنُ: 'نَفْعَ',
        },
      },
      أمر: {
        أَنْتَ: 'افْعَ',
        أَنْتُمَا: 'افْعَيَا',
        أَنْتُمْ: 'افْعَوْا',
        أَنْتِ: 'افْعَيْ',
        أَنْتُنَّ: 'افْعَيْنَ',
      },
    },
    مجهول: {
      ماضي: {
        هُوَ: 'فُعِيَ',
        هُمَا: {
          مُذَكَّر: 'فُعِيَا',
          مُؤَنَّث: 'فُعِيَتَا',
        },
        هُمْ: 'فُعُوْا',
        هِيَ: 'فُعِيَتْ',
        هُنَّ: 'فُعِيْنَ',
        أَنْتَ: 'فُعِيْتَ',
        أَنْتُمَا: 'فُعِيْتُمَا',
        أَنْتُمْ: 'فُعِيْتُمْ',
        أَنْتِ: 'فُعِيْتِ',
        أَنْتُنَّ: 'فُعِيْتُنَّ',
        أَنَا: 'فُعِيْتُ',
        نَحْنُ: 'فُعِيْنَا',
      },
      مضارع: {
        مرفوع: {
          هُوَ: 'يُفْعَى',
          هُمَا: {
            مُذَكَّر: 'يُفْعَيَانِ',
            مُؤَنَّث: 'تُفْعَيَانِ',
          },
          هُمْ: 'يُفْعَوْنَ',
          هِيَ: 'تُفْعَى',
          هُنَّ: 'يُفْعَيْنَ',
          أَنْتَ: 'تُفْعَى',
          أَنْتُمَا: 'تُفْعَيَانِ',
          أَنْتُمْ: 'تُفْعَوْنَ',
          أَنْتِ: 'تُفْعَيْنَ',
          أَنْتُنَّ: 'تُفْعَيْنَ',
          أَنَا: 'أُفْعَى',
          نَحْنُ: 'نُفْعَى',
        },
        منصوب: {
          هُوَ: 'يُفْعَى',
          هُمَا: {
            مُذَكَّر: 'يُفْعَيَا',
            مُؤَنَّث: 'تُفْعَيَا',
          },
          هُمْ: 'يُفْعَوْا',
          هِيَ: 'تُفْعَى',
          هُنَّ: 'يُفْعَيَنَ',
          أَنْتَ: 'تُفْعَى',
          أَنْتُمَا: 'تُفْعَيَا',
          أَنْتُمْ: 'تُفْعَوْا',
          أَنْتِ: 'تُفْعَيْ',
          أَنْتُنَّ: 'تُفْعَيَنَ',
          أَنَا: 'أُفْعَى',
          نَحْنُ: 'نُفْعَى',
        },
        مجزوم: {
          هُوَ: 'يُفْعَ',
          هُمَا: {
            مُذَكَّر: 'يُفْعَيَا',
            مُؤَنَّث: 'تُفْعَيَا',
          },
          هُمْ: 'يُفْعَوْا',
          هِيَ: 'تُفْعَ',
          هُنَّ: 'يُفْعَيْنَ',
          أَنْتَ: 'تُفْعَ',
          أَنْتُمَا: 'تُفْعَيَا',
          أَنْتُمْ: 'تُفْعَوْا',
          أَنْتِ: 'تُفْعَيْ',
          أَنْتُنَّ: 'تُفْعَيْنَ',
          أَنَا: 'أُفْعَ',
          نَحْنُ: 'نُفْعَ',
        },
      },
    },
  },
  مشتق: {
    مصدر: ['فِعًا'],
    فاعل: {
      مُذَكَّر: {
        مُفْرَد: 'فَاعٍ',
        مُثَنَّى: 'فَاعَانِ',
        جَمْع: 'فَاعُوْنَ',
      },
      مُؤَنَّث: {
        مُفْرَد: 'فَاعَةٌ',
        مُثَنَّى: 'فَاعَتَانِ',
        جَمْع: 'فَاعَاتٌ',
      },
    },
    مفعول: {
      مُذَكَّر: {
        مُفْرَد: 'مَفْعِيٌّ',
        مُثَنَّى: 'مَفْعِيَّانِ',
        جَمْع: 'مَفْعِيُّوْنَ',
      },
      مُؤَنَّث: {
        مُفْرَد: 'مَفْعِيَّةٌ',
        مُثَنَّى: 'مَفْعِيَّتَانِ',
        جَمْع: 'مَفْعِيَّاتٌ',
      },
    },
  },
}

export default chapter
