import type { Chapter } from '../../types'

const chapter: Chapter = {
  id: 'ajwaf/7',
  type: {
    arabic: 'أجوف',
    transliterated: 'ajwaf',
  },
  form: {
    number: 7,
    roman: 'VII',
    english: '7',
  },
  chapter: {
    arabic: 'انْفِعَال',
    transliterated: "infi'aal",
  },
  title: 'انْفَالَ يَنْفَالُ',
  root_letters: [
    {
      arabic: {
        ف: 'ه',
        ع: 'و',
        ل: 'ر',
      },
      english: {
        base: 'collapse',
        passive: 'demolished',
      },
      transliterated: 'inhaara',
    },
    {
      arabic: {
        ف: 'ق',
        ع: 'و',
        ل: 'د',
      },
      english: {
        base: 'follow',
        passive: 'led',
      },
      transliterated: 'inqaada',
    },
  ],
  'صرف صغير': {
    مصدر: 'انْفِيَالًا',
    معروف: {
      ماضي: 'انْفَالَ',
      مضارع: 'يَنْفَالُ',
      فاعل: 'مُنْفَالٌ',
    },
    مجهول: null,
    أمر: 'انْفَلْ',
    نهي: 'تَنْفَلْ',
  },
  'صرف كبير': {
    معروف: {
      ماضي: {
        هُوَ: 'انْفَالَ',
        هُمَا: {
          مُذَكَّر: 'انْفَالَا',
          مُؤَنَّث: 'انْفَالَتَا',
        },
        هُمْ: 'انْفَالُوْا',
        هِيَ: 'انْفَالَتْ',
        هُنَّ: 'انْفَلْنَ',
        أَنْتَ: 'انْفَلْتَ',
        أَنْتُمَا: 'انْفَلْتُمَا',
        أَنْتُمْ: 'انْفَلْتُمْ',
        أَنْتِ: 'انْفَلْتِ',
        أَنْتُنَّ: 'انْفَلْتُنَّ',
        أَنَا: 'انْفَلْتُ',
        نَحْنُ: 'انْفَلْنَا',
      },
      مضارع: {
        مرفوع: {
          هُوَ: 'يَنْفَالُ',
          هُمَا: {
            مُذَكَّر: 'يَنْفَالَانِ',
            مُؤَنَّث: 'تَنْفَالَانِ',
          },
          هُمْ: 'يَنْفَالُوْنَ',
          هِيَ: 'تَنْفَالُ',
          هُنَّ: 'يَنْفَلْنَ',
          أَنْتَ: 'تَنْفَالُ',
          أَنْتُمَا: 'تَنْفَالَانِ',
          أَنْتُمْ: 'تَنْفَالُوْنَ',
          أَنْتِ: 'تَنْفَالِيْنَ',
          أَنْتُنَّ: 'تَنْفَلْنَ',
          أَنَا: 'أَنْفَالُ',
          نَحْنُ: 'نَنْفَالُ',
        },
        منصوب: {
          هُوَ: 'يَنْفَالَ',
          هُمَا: {
            مُذَكَّر: 'يَنْفَالَا',
            مُؤَنَّث: 'تَنْفَالَا',
          },
          هُمْ: 'يَنْفَالُوْا',
          هِيَ: 'تَنْفَالَ',
          هُنَّ: 'يَنْفَلْنَ',
          أَنْتَ: 'تَنْفَالَ',
          أَنْتُمَا: 'تَنْفَالَا',
          أَنْتُمْ: 'تَنْفَالُوْا',
          أَنْتِ: 'تَنْفَالِيْ',
          أَنْتُنَّ: 'تَنْفَلْنَ',
          أَنَا: 'أَنْفَالَ',
          نَحْنُ: 'نَنْفَالَ',
        },
        مجزوم: {
          هُوَ: 'يَنْفَلْ',
          هُمَا: {
            مُذَكَّر: 'يَنْفَالَا',
            مُؤَنَّث: 'تَنْفَالَا',
          },
          هُمْ: 'يَنْفَالُوْا',
          هِيَ: 'تَنْفَلْ',
          هُنَّ: 'يَنْفَلْنَ',
          أَنْتَ: 'تَنْفَلْ',
          أَنْتُمَا: 'تَنْفَالَا',
          أَنْتُمْ: 'تَنْفَالُوْا',
          أَنْتِ: 'تَنْفَالِيْ',
          أَنْتُنَّ: 'تَنْفَلْنَ',
          أَنَا: 'أَنْفَلْ',
          نَحْنُ: 'نَنْفَلْ',
        },
      },
      أمر: {
        أَنْتَ: 'انْفَلْ',
        أَنْتُمَا: 'انْفَالَا',
        أَنْتُمْ: 'انْفَالُوْا',
        أَنْتِ: 'انْفَالِيْ',
        أَنْتُنَّ: 'انْفَلْنَ',
      },
    },
    مجهول: null,
  },
  مشتق: {
    مصدر: ['انْفِيَالًا'],
    فاعل: {
      مُذَكَّر: {
        مُفْرَد: 'مُنْفَالٌ',
        مُثَنَّى: 'مُنْفَالَانِ',
        جَمْع: 'مُنْفَالُوْنَ',
      },
      مُؤَنَّث: {
        مُفْرَد: 'مُنْفَالَةٌ',
        مُثَنَّى: 'مُنْفَالَتَانِ',
        جَمْع: 'مُنْفَالَاتٌ',
      },
    },
    مفعول: null,
  },
}

export default chapter
