import type { Chapter } from '../../types'

const chapter: Chapter = {
  id: 'ajwaf/9',
  type: {
    arabic: 'أجوف',
    transliterated: 'ajwaf',
  },
  form: {
    number: 9,
    roman: 'IX',
    english: '9',
  },
  chapter: {
    arabic: 'افْعِلَال',
    transliterated: "if'ilaal",
  },
  title: 'افْوَلَّ يَفْوَلُّ',
  root_letters: [
    {
      arabic: {
        ف: 'س',
        ع: 'و',
        ل: 'د',
      },
      english: {
        base: 'black',
        prefixToBe: true,
      },
      transliterated: 'iswadda',
    },
    {
      arabic: {
        ف: 'ح',
        ع: 'و',
        ل: 'ل',
      },
      english: {
        base: 'cross-eyed',
        prefixToBe: true,
      },
      transliterated: 'ihwalla',
    },
  ],
  'صرف صغير': {
    مصدر: 'افْوِلَالً',
    معروف: {
      ماضي: 'افْوَلَّ',
      مضارع: 'يَفْوَلُّ',
      فاعل: 'مُفْوَلٌّ',
    },
    مجهول: null,
    أمر: 'افْوَلَّ',
    نهي: 'تَفْوَلَّ',
  },
  'صرف كبير': {
    معروف: {
      ماضي: {
        هُوَ: 'افْوَلَّ',
        هُمَا_مُذَكَّر: 'افْوَلَّا',
        هُمَا_مُؤَنَّث: 'افْوَلَّتَا',
        هُمْ: 'افْوَلُّوْا',
        هِيَ: 'افْوَلَّتْ',
        هُنَّ: 'افْوَلَدْنَ',
        أَنْتَ: 'افْوَلَدْتَ',
        أَنْتُمَا: 'افْوَلَدْتُمَا',
        أَنْتُمْ: 'افْوَلَدْتُمْ',
        أَنْتِ: 'افْوَلَدْتِ',
        أَنْتُنَّ: 'افْوَلَدْتُنَّ',
        أَنَا: 'افْوَلَدْتُ',
        نَحْنُ: 'افْوَلَدْنَا',
      },
      مضارع: {
        مرفوع: {
          هُوَ: 'يَفْوَلُّ',
          هُمَا_مُذَكَّر: 'يَفْوَلَّانِ',
          هُمَا_مُؤَنَّث: 'تَفْوَلَّانِ',
          هُمْ: 'يَفْوَلُّوْنَ',
          هِيَ: 'تَفْوَلُّ',
          هُنَّ: 'يَفْوَلِدْنَ',
          أَنْتَ: 'تَفْوَلُّ',
          أَنْتُمَا: 'تَفْوَلَّانِ',
          أَنْتُمْ: 'تَفْوَلُّوْنَ',
          أَنْتِ: 'تَفْوَلِّيْنَ',
          أَنْتُنَّ: 'تَفْوَلِدْنَ',
          أَنَا: 'أَفْوَلُّ',
          نَحْنُ: 'نَفْوَلُّ',
        },
        منصوب: {
          هُوَ: 'يَفْوَلَّ',
          هُمَا_مُذَكَّر: 'يَفْوَلَّا',
          هُمَا_مُؤَنَّث: 'تَفْوَلَّا',
          هُمْ: 'يَفْوَلُّوْا',
          هِيَ: 'تَفْوَلَّ',
          هُنَّ: 'يَفْوَلِدْنَ',
          أَنْتَ: 'تَفْوَلَّ',
          أَنْتُمَا: 'تَفْوَلَّا',
          أَنْتُمْ: 'تَفْوَلُّوْا',
          أَنْتِ: 'تَفْوَلِّيْ',
          أَنْتُنَّ: 'تَفْوَلِدْنَ',
          أَنَا: 'أَفْوَلَّ',
          نَحْنُ: 'نَفْوَلَّ',
        },
        مجزوم: {
          هُوَ: 'يَفْوَلَّ',
          هُمَا_مُذَكَّر: 'يَفْوَلَّا',
          هُمَا_مُؤَنَّث: 'تَفْوَلَّا',
          هُمْ: 'يَفْوَلُّوْا',
          هِيَ: 'تَفْوَلَّ',
          هُنَّ: 'يَفْوَلِدْنَ',
          أَنْتَ: 'تَفْوَلَّ',
          أَنْتُمَا: 'تَفْوَلَّا',
          أَنْتُمْ: 'تَفْوَلُّوْا',
          أَنْتِ: 'تَفْوَلِّيْ',
          أَنْتُنَّ: 'تَفْوَلِدْنَ',
          أَنَا: 'أَفْوَلَّ',
          نَحْنُ: 'نَفْوَلَّ',
        },
      },
      أمر: {
        أَنْتَ: 'افْوَلَّ',
        أَنْتُمَا: 'افْوَلَّا',
        أَنْتُمْ: 'افْوَلُّوْا',
        أَنْتِ: 'افْوَلِّيْ',
        أَنْتُنَّ: 'افْوَلِدْنَ',
      },
    },
    مجهول: null,
  },
  مشتق: {
    مصدر: ['افْوِلَالً'],
    فاعل: {
      مُذَكَّر: {
        مُفْرَد: 'مُفْوَلٌّ',
        مُثَنَّى: 'مُفْوَلَّانِ',
        جَمْع: 'مُفْوَلُّوْنَ',
      },
      مُؤَنَّث: {
        مُفْرَد: 'مُفْوَلَّةٌ',
        مُثَنَّى: 'مُفْوَلَّتَانِ',
        جَمْع: 'مُفْوَلَّاتٌ',
      },
    },
    مفعول: null,
  },
}

export default chapter
